{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_regularizer": null, "activation": "relu", "name": "conv2d_1", "data_format": "channels_last", "batch_input_shape": [null, 28, 28, 1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 32, "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "name": "conv2d_2", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "filters": 64, "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Dense", "config": {"units": 128, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "name": "dense_1", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"units": 128, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "name": "dense_2", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.5}}, {"class_name": "Dense", "config": {"units": 10, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "kernel_constraint": null, "name": "dense_3", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}]}